var testid = "2016040810003";
var kclist_ary=[
{'id':1,'title':'由P[1]点开始沿着过P[2]点的圆弧以2000mm/sec的速度运动至P[3]点的程序为_______________。'},
{'id':2,'title':'标签指令LBL用于________________。'},
{'id':3,'title':'无条件跳转指令格式是________________，它的作用是指在同一个程序中，________________，即将程序控制转移到指定的标签。'},
{'id':4,'title':'寄存器指令R是在寄存器上完成算术运算。寄存器是一个存储数据的________，本机器人控制系统提供________个R寄存器。'},
{'id':5,'title':'寄存器指令R[i]=(value)的作用是把数值(value)________给指定的R寄存器。'},
{'id':6,'title':'寄存器指令格式为R[i]=(value)（operator）(value)，其中Value——可以取________、寄存器（R）、位置寄存器中的某个轴（PR[i,j]）、________、模拟量输入/输出(AI[i]/AO[i])，Operator是指把两个数值进行________、MOD、DIV操作。'},
{'id':7,'title':'位置寄存器是一个存储________，本系统提供________个位置寄存器。'},
{'id':8,'title':'简述程序IF R[1] = R[2], JMP LBL[1]的作用。'},
{'id':9,'title':'位置寄存器PR与P有什么不同？'},
{'id':10,'title':'简述喷漆循环的流程。'},
{'id':11,'title':'简述工具坐标系六点标定法。'},
{'id':12,'title':'在工业机器人末端安装一直杆，以桌子一角为原点，桌边为X、Y方向，建立工件坐标系。'},
{'id':13,'title':'在桌子上放一杯子，编制程序控制工业机器人从桌子一角绕过杯子移动到另一角。'},
{'id':14,'title':'编制程序控制工业机器人在两点之间往复移动，循环10次后，返回参考点。'}
];