var testid = "2016040810001";
var kclist_ary=[
{'id':1,'title':'工业机器人由________、________、和________三个基本部分组成。'},
{'id':2,'title':'工业机器人一般有四个坐标系，________、________、________和________。'},
{'id':3,'title':'工业机器人本体一般采用________机构，其中的运动副（转动副或移动副）常称为关节，关节个数通常即为机器人的自由度数，大多数工业机器人有________个运动自由度。'},
{'id':4,'title':'工业机器人按应用领域分类可分为搬运机器人、________、________、________、________、________等。'},
{'id':5,'title':'简述工业机器人的定义。'},
{'id':6,'title':'简述工业机器人的主要应用领域。 '},
{'id':7,'title':'简述操作工业机器人时需要注意哪些安全事项。'},
{'id':8,'title':'HSR-612工业机器人控制系统的主要控制功能有哪些？'},
{'id':9,'title':'按臂部的运动形式分类，工业机器人可分为哪几类？'},
{'id':10,'title':'分别在基坐标系、关节坐标系、工具坐标系下，以三种不同的姿态接近一固定点。'},
{'id':11,'title':'分别在基坐标系和工具坐标系下，手动操作工业机器人绕一点运动。'}
];