var testid = "2016040810003";
var kclist_ary=[
{'id':1,'title':'机器人的喷涂工作主要有3种模式：________、________和________。'},
{'id':2,'title':'程序"L P[1] 100mm/sec FINE"的作用是控制机器人以________速度采用________移动至目标点P[1]。'},
{'id':3,'title':'直线运动指令的进给速度的单位可为________________，最大值由参数限制。通过区别起点和终点时的姿态，来控制被驱动的工具的姿态。'},
{'id':4,'title':'输入/输出条件等待指令将________与另一个值进行比较，并等待________为止。'},
{'id':5,'title':'简述喷涂机器人的定义、特点、作用和应用场合。'},
{'id':6,'title':'与传统的机械喷涂相比，机器人喷涂有什么优点？'},
{'id':7,'title':'简述喷涂机器人的工作流程。'},
{'id':8,'title':'试在工业机器人末端安装一支笔，编制程序，控制工业机器人画一个五角星。'},
{'id':9,'title':'试将工业机器人与一个简单控制器连接，编制程序控制机器人，当有输入信号时，控制机器人移动到特定位置。'}
];