var testid = "2016040810003";
var kclist_ary=[
{'id':1,'title':'子程序调用指令_________将程序控制转移到__________,并________。'},
{'id':2,'title':'当子程序执行到子程序执行到程序结束指令（END）时时，控制会迅速的返回到调用程序（主程序）中的________________，继续向后执行。'},
{'id':3,'title':'增量指令将运动指令中的位置数据用作当前位置的________________，即增量指令中的位置数据为机器人________________。'},
{'id':4,'title':'使用增量指令时，当位置数据为________标值时，提供了每个轴的增量数据。'},
{'id':5,'title':'使用增量指令时当________作为位置数据时，用户坐标系的基准通过用户坐标系的序号指定，而用户坐标系的序号是在位置数据中指定的。'},
{'id':6,'title':'使用增量指令时当位置寄存器作为位置数据时，基准坐标系即为________。'},
{'id':7,'title':'程序L P[1] 500mm/sec FINE INC的意义是什么？'},
{'id':8,'title':'程序IF R[R[3]] >= 123, CALL subprog1的意义是什么？'},
{'id':9,'title':'当工业机器人所使用的工具的TCP点相对与默认工具0的坐标方向没变，只是TCP相对于工具0的Y方向和Z正方向偏移了200mm时，如何建立工具坐标系？'},
{'id':10,'title':'简述工件坐标系的三点标定法。'},
{'id':11,'title':'编制两个子程序分别控制工业机器人沿X轴两点往复移动和沿Y轴两点往复移动，再编制一个主程序，调用这两个子程序，实现沿着X轴移动两次后沿Y轴移动一次。'},
{'id':12,'title':'如图所示图形边长都为50mm。试编制程序控制工业机器人在平面内画出该图形。'}
];