var testid = "2016040810002";
var kclist_ary=[
{'id':1,'title':'程序是为使机器人完成某种任务而设置的________。常见的程序编制方法有两种，________和________。'},
{'id':2,'title':'用来实现以指定速度、特定路线模式等将工具从一个位置移动到另一个指定位置的指令是________。'},
{'id':3,'title':'机器人动作类型有三种：________（J）、________（L）、________（C）。'},
{'id':4,'title':'使用工业机器人完成搬运工作，要经过5个主要工作环节，包括________、________、________、________、________。'},
{'id':5,'title':'位置数据包括________和________。'},
{'id':6,'title':'简述搬运机器人的特点和应用场合。'},
{'id':7,'title':'简述示教编程方法的定义和特点。'},
{'id':8,'title':'程序的基本信息有哪些？其功能分别是是什么？'},
{'id':9,'title':'简述搬运机器人的工作流程。'},
{'id':10,'title':'试建立机器人法兰盘端面中心工具坐标系。'},
{'id':11,'title':'试编制程序，控制机器人法兰盘端面从参考点位置移动到空间一固定点，然后返回到参考点。'}
];