var testid = "2016040810003";
var kclist_ary=[
{'id':1,'title':'_________指令在位置寄存器上完成计算操作。PR[i, j]中的元素 i 代表__________，j 代表________。'},
{'id':2,'title':'位置寄存器轴指令可以将位置数据元素的值，或两个数据的和、差、商、余数等赋值给指定的________________。'},
{'id':3,'title':'程序UFRAME[i]=(value)中value可以取_______________________。'},
{'id':4,'title':'工件坐标系的序号取值范围为_______________。'},
{'id':5,'title':'当机器人在两个工件坐标系中的轨迹相同时，可以______________，无需重复轨迹编程了。'},
{'id':6,'title':'程序“PR[ i, j ]=(value)(operator)(value)”中value可以取哪些值？'},
{'id':7,'title':'程序“PR[1] =UFRAME[1] ，UFRAME[2] = PR[1]”的作用是什么？'},
{'id':8,'title':'下图为机器人码垛任务中工件的排放位置，图中工件的长度为300mm，宽度为200mm，高度为100mm，试计算各个位置的坐标值。'},
{'id':9,'title':'试在一个坐标系下编制程序，控制工业机器人在平面内画出如图所示图形。'},
{'id':10,'title':'试建立两个坐标系，利用坐标系变换编制程序，控制工业机器人在平面内画出如图所示图形。'}
];