var testid = "2016040810003";
var kclist_ary=[
{'id':1,'title':'工业机器人的编程方式主要有________和________。'},
{'id':2,'title':'通过离线编程软件不仅可以规划机器人路径生成轨迹、____________，还可以___________、干涉检查以及实现对机器人参数、工具参数的实时修改。'},
{'id':3,'title':'机器人离线编程系统是以实现机器人离线编程为主要功能的工具，主要包括操作界面、三维模型、运动模型、_______________、____________、后置处理器、数据通信接口和机器人误差补偿。'},
{'id':4,'title':'离线编程从狭义上讲，指通过三维模型生成NC程序的过程，概念上与数控加工离线编程类似，都必须经过____________、____________ ，运动仿真，后置处理几个步骤。'},
{'id':5,'title':'与在线示教编程比较，离线编程有什么优点？'},
{'id':6,'title':'HSRC离线编程软件主要操作特点是什么？'},
{'id':7,'title':'离线编程的操作过程包括哪些？'}
];